In [1]:
import pandas as pd
import re

In [2]:
nba_data = """Celtics:
Record: 12-2, 1st in NBA Eastern Conference
Last Game: W 95-94 vs. TOR
Next Game: Tuesday, Nov. 14 at BRK
Coach: Brad Stevens (12-2)
Executive: Danny Ainge
PTS/G: 102.2 (24th of 30) Opp PTS/G: 94.0 (1st of 30)
SRS: 7.38 (3rd of 30) Pace: 96.4 (26th of 30)
Off Rtg: 106.0 (17th of 30) Def Rtg: 97.5 (1st of 30)

Hawks:
Record: 2-11, 15th in NBA Eastern Conference
Last Game: L 94-113 at WAS
Next Game: Monday, Nov. 13 at NOP
Coach: Mike Budenholzer (2-11)
Executive: Travis Schlenk
PTS/G: 102.5 (23rd of 30) Opp PTS/G: 110.8 (26th of 30)
SRS: -8.59 (27th of 30) Pace: 100.0 (9th of 30)
Off Rtg: 102.4 (25th of 30) Def Rtg: 110.8 (27th of 30)

Spurs:
Record: 8-5, 3rd in NBA Western Conference
Last Game: W 133-94 vs. CHI
Next Game: Tuesday, Nov. 14 at DAL
Coach: Gregg Popovich (8-5)
Executive: R.C. Buford
PTS/G: 103.0 (22nd of 30) Opp PTS/G: 99.6 (5th of 30)
SRS: 3.04 (9th of 30) Pace: 96.4 (27th of 30)
Off Rtg: 106.9 (16th of 30) Def Rtg: 103.4 (6th of 30)

Knicks:
Record: 7-5, 4th in NBA Eastern Conference
Last Game: W 118-91 vs. SAC
Next Game: Monday, Nov. 13 vs. CLE
Coach: Jeff Hornacek (7-5)
Executive: Steve Mills
PTS/G: 106.4 (16th of 30) Opp PTS/G: 105.0 (13th of 30)
SRS: 1.12 (14th of 30) Pace: 96.5 (25th of 30)
Off Rtg: 110.2 (6th of 30) Def Rtg: 108.8 (21st of 30)

Bulls:
Record: 2-9, 14th in NBA Eastern Conference
Last Game: L 94-133 at SAS
Next Game: Wednesday, Nov. 15 at OKC
Coach: Fred Hoiberg (2-9)
Executive: Gar Forman
PTS/G: 93.6 (30th of 30) Opp PTS/G: 103.9 (10th of 30)
SRS: -9.69 (29th of 30) Pace: 96.1 (29th of 30)
Off Rtg: 96.6 (30th of 30) Def Rtg: 107.2 (19th of 30)"""

In [11]:
m = re.search('\d+[a-z]{2}', nba_data)
if m: 
    print (m.group())
else: 
    print ('No match')

1st

In [12]:
m.group()

'1st'

In [14]:
m = re.search('Coach: (.+) \(', nba_data)
if m: 
    print (m.group(1))
else: 
    print ('No match')

Brad Stevens

In [15]:
m = re.search('Record: (\d+)-(\d+)', nba_data)
if m: 
    print (m.group(1))
else: 
    print ('No match')

12

In [18]:
re.findall('Coach: (.+) \(', nba_data)

['Brad Stevens',
 'Mike Budenholzer',
 'Gregg Popovich',
 'Jeff Hornacek',
 'Fred Hoiberg']

In [19]:
re.findall('Record: (\d+)-(\d+)', nba_data)

[('12', '2'), ('2', '11'), ('8', '5'), ('7', '5'), ('2', '9')]

In [23]:
url = 'https://google.com?search=foobar'

In [25]:
re.sub(r'\?+\w+=\w+','', url)

'https://google.com'

In [26]:
re.sub(r'\?.*','', url)

'https://google.com'

In [27]:
s = 'The-quick-brOwn_fox_juMped_over_The-lazy-dog'

In [29]:
re.sub(r'[-_][A-z]',lambda m: m.group()[-1].upper(), s.lower())

'theQuickBrownFoxJumpedOverTheLazyDog'

In [30]:
df = pd.read_csv('train.csv')

In [31]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [34]:
df['Name'][0:5]

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [38]:
df['Title']= df['Name'].str.extract(', ([^.]+)\.', expand=False)

In [40]:
df[['Title', 'Survived']].groupby('Title').count()

              Survived
Title
Capt                 1
Col                  2
Don                  1
Dr                   7
Jonkheer             1
Lady                 1
Major                2
Master              40
Miss               182
Mlle                 2
Mme                  1
Mr                 517
Mrs                125
Ms                   1
Rev                  6
Sir                  1
the Countess         1

In [42]:
df.loc[df['Name'].str.contains('Rev'),:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
149,150,0,2,"Byles, Rev. Thomas Roussel Davids",male,42.0,0,0,244310,13.000,NaN,S,Rev
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.525,NaN,S,Rev
249,250,0,2,"Carter, Rev. Ernest Courtenay",male,54.0,1,0,244252,26.000,NaN,S,Rev
626,627,0,2,"Kirkland, Rev. Charles Leonard",male,57.0,0,0,219533,12.350,NaN,Q,Rev
848,849,0,2,"Harper, Rev. John",male,28.0,0,1,248727,33.000,NaN,S,Rev
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S,Rev

In [45]:
from sklearn.linear_model import LogisticRegression
from sklearn.pipeline import Pipeline, FeatureUnion
from sklearn.preprocessing import FunctionTransformer